app/controllers/cards_controller.rb

  def all_shuffled_cards number_of_players
    @cards = Card.all
---
SELECT "cards".* FROM "cards" WHERE (NOT (value = '10' and suit = 'heart')) AND (NOT (value = '2' and suit = 'spade')) AND (NOT (value = '2' and suit = 'club')) AND (NOT (value = '3' and suit = 'spade')) AND (NOT (value = 'A' and suit = 'spade'))  ORDER BY random()